[
  {
    "name": "Blog App",
    "Content": "In this project, you have to write the backend part of the blog app, where the user can register and log in and after that, he can post and view the blogs. and also he can like and dislike. For this app, you should use Express, Mysql, Knex, and **JWT** for authentication.\n\n1. Register using email & password ( use JWT for authentication )\n2. log in (varify email and password)\n3. Create a post (Only logged in users can create a post)\n4. See all posts from other users on the home page.\n5. Get/update/delete blog by id.\n6. Logged in users can like/dislike anyone's blog.\n7. See how many likes/dislikes a post has in real-time.\n\nLive Demo: [`BlogoFile`](https://blogofile.herokuapp.com)",
    "topic": "NodeJs"
  },
  {
    "name": "Zomato API",
    "Content": "You have to used Zomato-API [`https://apitracker.io/a/zomato`](https://apitracker.io/a/zomato). to get the details of restaurants present in a particular location. You'll be asked a location to fetch the details like average cost for two people, price ranges, has online delivery or not, and cuisines of that location.",
    "topic": "NodeJs"
  },
  {
    "name": "Passport-Strategies",
    "Content": "In this project you have to implement Google, LinkedIn and GiHub strategies(http://www.passportjs.org/) where the user can login by using these strategies.",
    "topic": "NodeJs"
  },
  {
    "name": "Email Slicer Project",
    "Content": "The email slicer is a handy program to get the username and domain name from an email address.",
    "topic": "Basic Python"
  },
  {
    "name": "Message Encode Decode in Python Project",
    "Content": "Secure sensitive information by encoding messages. The objective of this project is to encode (or encrypt) and decode messages using a common key. This Python project will be built using base64 library.",
    "topic": "Basic Python"
  },
  {
    "name": "Number Guessing",
    "Content": "This project is an exciting fun game for beginners to build up. The program generates a random number from 1 to 10, or 1 to 100 any range that is specified and the user must guess the number after a hint from the computer. Every time a user’s guess is wrong they are prompted with more hints to make it easier for them to guess the number but at the cost of reducing the score. The clue any math clue like multiples, divisible, greater or smaller, or a combination of all. ",
    "topic": "Basic Python"
  },
  {
    "name": "Website Blocker",
    "Content": "We all know while surfing through the net many unwanted sites popup to distract us. This project comes at help in such cases as it can be built up to block certain websites from opening. The program is beneficial for people who get easily distracted to switch to social media sites while into something serious.     ",
    "topic": "Advance Python"
  },
  {
    "name": "Calculator",
    "Content": "Building this project you would learn to design a graphical UI and make you familiar with a library like Tkinter. This library enables you to create buttons to perform different operations and display results on the screen. ",
    "topic": "Basic Python"
  },
  {
    "name": "Alarm Clock",
    "Content": "This is an interesting Command Line Interface (CLI) Python application for an intermediate-level developer. People across the globe use alarm clock features in their devices but this project can be altered in a bit different manner. Some certain YouTube links can be added to a text file and the project is programmed in a way that when a user sets an alarm then the code shall pick a random link from the video and will start playing the YouTube link.",
    "topic": "Advance Python"
  },
  {
    "name": "Currency Converter ",
    "Content": "This is a straightforward project with a simple GUI. The name quite evidently describes the role of the project is to convert currencies from one unit into another. For example, converting Indian rupee to USD or euro. Tkinter, the standard Python interface can be used to design and develop this application. ",
    "topic": "Advance Python"
  },
  {
    "name": "Convert Text to Speech in Python",
    "Content": "Convert your text into voice with Python and Google APIs.Text to speech project takes words as input on digital devices and converts them into audio or speech with a button click or finger touch.",
    "topic": "Advance Python"
  }
]
